{
    "<sos>": 1,
    "<eos>": 2,
    "<unk>": 3,
    "A2M": 4,
    "ACE2": 5,
    "ACTA2": 6,
    "ACTB": 7,
    "ADAM10": 8,
    "ADAM12": 9,
    "ADAM28": 10,
    "ADAMTS4": 11,
    "ADAMTS5": 12,
    "AIF1": 13,
    "AIFM2": 14,
    "AIRE": 15,
    "AKT1": 16,
    "ANPEP": 17,
    "ANXA1": 18,
    "APOE": 19,
    "AR": 20,
    "AREG": 21,
    "ARG1": 22,
    "ARID1A": 23,
    "ARPC3": 24,
    "ARPC5": 25,
    "ATM": 26,
    "BANK1": 27,
    "BATF3": 28,
    "BCL2": 29,
    "BCL6": 30,
    "BGN": 31,
    "BRAF": 32,
    "C1QB": 33,
    "C1QBP": 34,
    "C1R": 35,
    "C1S": 36,
    "C5AR1": 37,
    "CAV1": 38,
    "CAVIN1": 39,
    "CAVIN2": 40,
    "CCL11": 41,
    "CCL13": 42,
    "CCL14": 43,
    "CCL15": 44,
    "CCL16": 45,
    "CCL19": 46,
    "CCL2": 47,
    "CCL20": 48,
    "CCL21": 49,
    "CCL26": 50,
    "CCL28": 51,
    "CCL3": 52,
    "CCL3L1": 53,
    "CCL4": 54,
    "CCL5": 55,
    "CCL7": 56,
    "CCL8": 57,
    "CCND1": 58,
    "CCR1": 59,
    "CCR2": 60,
    "CCR3": 61,
    "CCR4": 62,
    "CCR5": 63,
    "CCR6": 64,
    "CCR7": 65,
    "CCR8": 66,
    "CD14": 67,
    "CD163": 68,
    "CD19": 69,
    "CD1A": 70,
    "CD1C": 71,
    "CD2": 72,
    "CD247": 73,
    "CD27": 74,
    "CD274": 75,
    "CD276": 76,
    "CD28": 77,
    "CD300E": 78,
    "CD37": 79,
    "CD38": 80,
    "CD3D": 81,
    "CD3E": 82,
    "CD4": 83,
    "CD40": 84,
    "CD40LG": 85,
    "CD44": 86,
    "CD47": 87,
    "CD68": 88,
    "CD7": 89,
    "CD74": 90,
    "CD79A": 91,
    "CD79B": 92,
    "CD80": 93,
    "CD83": 94,
    "CD86": 95,
    "CD8A": 96,
    "CD8B": 97,
    "CDH3": 98,
    "CDK1": 99,
    "CDK12": 100,
    "CDK2": 101,
    "CDK4": 102,
    "CDK6": 103,
    "CDKN1A": 104,
    "CDKN1B": 105,
    "CDKN1C": 106,
    "CDKN2A": 107,
    "CDKN2B": 108,
    "CDKN2C": 109,
    "CDKN2D": 110,
    "CDX1": 111,
    "CDX2": 112,
    "CEACAM1": 113,
    "CEACAM6": 114,
    "CEACAM8": 115,
    "CENPF": 116,
    "CENPV": 117,
    "CFC1": 118,
    "CHI3L1": 119,
    "CHIT1": 120,
    "CIITA": 121,
    "CLDN18": 122,
    "CLEC10A": 123,
    "CLEC12A": 124,
    "CMKLR1": 125,
    "COL11A1": 126,
    "COL14A1": 127,
    "COL1A1": 128,
    "COL1A2": 129,
    "COL3A1": 130,
    "COL4A1": 131,
    "COL5A1": 132,
    "COL6A1": 133,
    "COL6A3": 134,
    "CORO1A": 135,
    "COTL1": 136,
    "CPA3": 137,
    "CREB3L1": 138,
    "CSF1": 139,
    "CSF1R": 140,
    "CST3": 141,
    "CST7": 142,
    "CTLA4": 143,
    "CTNNB1": 144,
    "CTSB": 145,
    "CTSD": 146,
    "CTSL": 147,
    "CTSS": 148,
    "CTSW": 149,
    "CX3CR1": 150,
    "CXCL1": 151,
    "CXCL10": 152,
    "CXCL11": 153,
    "CXCL12": 154,
    "CXCL13": 155,
    "CXCL14": 156,
    "CXCL16": 157,
    "CXCL2": 158,
    "CXCL3": 159,
    "CXCL5": 160,
    "CXCL6": 161,
    "CXCL9": 162,
    "CXCR1": 163,
    "CXCR2": 164,
    "CXCR3": 165,
    "CXCR4": 166,
    "CXCR5": 167,
    "CXCR6": 168,
    "DCN": 169,
    "DERL3": 170,
    "DGKA": 171,
    "DMBT1": 172,
    "DUSP2": 173,
    "EGF": 174,
    "EGFR": 175,
    "EGR3": 176,
    "ENTPD1": 177,
    "EOMES": 178,
    "EPCAM": 179,
    "EPO": 180,
    "EPOR": 181,
    "ERBB2": 182,
    "ERBB3": 183,
    "ERBB4": 184,
    "ESR1": 185,
    "FABP3": 186,
    "FADD": 187,
    "FAP": 188,
    "FAS": 189,
    "FASLG": 190,
    "FCER1A": 191,
    "FCER2": 192,
    "FCGR1A": 193,
    "FCGR2A": 194,
    "FCGR2B": 195,
    "FCGR3A": 196,
    "FCMR": 197,
    "FCRL3": 198,
    "FEZ1": 199,
    "FGF2": 200,
    "FGR": 201,
    "FHIT": 202,
    "FKBP11": 203,
    "FLT1": 204,
    "FLT3LG": 205,
    "FLT4": 206,
    "FN1": 207,
    "FOS": 208,
    "FOXA1": 209,
    "FOXP3": 210,
    "FUT4": 211,
    "G0S2": 212,
    "GATA2": 213,
    "GATA3": 214,
    "GLIPR2": 215,
    "GNLY": 216,
    "GPC1": 217,
    "GPC3": 218,
    "GPR171": 219,
    "GPR183": 220,
    "GPR34": 221,
    "GUCY2C": 222,
    "GZMA": 223,
    "GZMB": 224,
    "GZMH": 225,
    "GZMK": 226,
    "HAVCR2": 227,
    "HGF": 228,
    "HIF1A": 229,
    "HLA-A": 230,
    "HLA-B": 231,
    "HLA-C": 232,
    "HLA-DMA": 233,
    "HLA-DMB": 234,
    "HLA-DPA1": 235,
    "HLA-DQA1": 236,
    "HLA-DRA": 237,
    "HPGDS": 238,
    "ICAM1": 239,
    "ICOSLG": 240,
    "ID1": 241,
    "ID2": 242,
    "ID4": 243,
    "IDO1": 244,
    "IFIT2": 245,
    "IFIT3": 246,
    "IFITM3": 247,
    "IFNAR1": 248,
    "IFNAR2": 249,
    "IFNB1": 250,
    "IFNGR1": 251,
    "IFNGR2": 252,
    "IFNL1": 253,
    "IGFBP7": 254,
    "IGHG1": 255,
    "IGHG2": 256,
    "IGHG3": 257,
    "IGHG4": 258,
    "IGHGP": 259,
    "IGHM": 260,
    "IGKC": 261,
    "IGLC3": 262,
    "IL10": 263,
    "IL10RA": 264,
    "IL11": 265,
    "IL12B": 266,
    "IL12RB2": 267,
    "IL13": 268,
    "IL13RA2": 269,
    "IL15": 270,
    "IL15RA": 271,
    "IL18": 272,
    "IL1A": 273,
    "IL1B": 274,
    "IL1R1": 275,
    "IL1RAP": 276,
    "IL2": 277,
    "IL21": 278,
    "IL21R": 279,
    "IL22RA1": 280,
    "IL22RA2": 281,
    "IL23A": 282,
    "IL2RA": 283,
    "IL2RB": 284,
    "IL2RG": 285,
    "IL4": 286,
    "IL4R": 287,
    "IL5": 288,
    "IL6": 289,
    "IL7R": 290,
    "IQGAP2": 291,
    "IRF1": 292,
    "IRF2": 293,
    "IRF3": 294,
    "IRF4": 295,
    "IRF5": 296,
    "IRF8": 297,
    "ISG15": 298,
    "ITGA1": 299,
    "ITGA11": 300,
    "ITGAE": 301,
    "ITGAM": 302,
    "ITGAX": 303,
    "JAK1": 304,
    "JAK2": 305,
    "JAK3": 306,
    "JCHAIN": 307,
    "JUN": 308,
    "JUNB": 309,
    "KDR": 310,
    "KIT": 311,
    "KLRB1": 312,
    "KLRC1": 313,
    "KLRD1": 314,
    "KLRF1": 315,
    "KLRK1": 316,
    "KMT2C": 317,
    "KRAS": 318,
    "LAG3": 319,
    "LAMP1": 320,
    "LAMP2": 321,
    "LAMP3": 322,
    "LAYN": 323,
    "LCK": 324,
    "LIF": 325,
    "LILRA4": 326,
    "LILRA5": 327,
    "LILRB2": 328,
    "LILRB4": 329,
    "LOXL2": 330,
    "LRP1": 331,
    "LRRC15": 332,
    "LTB": 333,
    "LUM": 334,
    "LY6E": 335,
    "LYZ": 336,
    "MARCO": 337,
    "MCEMP1": 338,
    "MDK": 339,
    "MET": 340,
    "MGP": 341,
    "MIS18BP1": 342,
    "MKI67": 343,
    "MME": 344,
    "MMP1": 345,
    "MMP11": 346,
    "MMP12": 347,
    "MMP14": 348,
    "MMP2": 349,
    "MMP3": 350,
    "MMP7": 351,
    "MMP9": 352,
    "MPEG1": 353,
    "MRC1": 354,
    "MS4A1": 355,
    "MS4A2": 356,
    "MSLN": 357,
    "MUC5AC": 358,
    "MX1": 359,
    "MYC": 360,
    "MYD88": 361,
    "MZB1": 362,
    "NCAM1": 363,
    "NCEH1": 364,
    "NELL2": 365,
    "NF1": 366,
    "NKG7": 367,
    "NLRC5": 368,
    "NOD1": 369,
    "NOS2": 370,
    "NOSIP": 371,
    "NOTCH1": 372,
    "NOTCH2": 373,
    "NOTCH3": 374,
    "NT5E": 375,
    "ORC6": 376,
    "P2RX1": 377,
    "PAX5": 378,
    "PCNA": 379,
    "PDCD1": 380,
    "PDCD1LG2": 381,
    "PDGFRA": 382,
    "PECAM1": 383,
    "PGA5": 384,
    "PGR": 385,
    "PIK3CA": 386,
    "PIN1": 387,
    "PLA2G7": 388,
    "PLAUR": 389,
    "PLD4": 390,
    "PLEK": 391,
    "PLVAP": 392,
    "POSTN": 393,
    "PPARG": 394,
    "PRDM1": 395,
    "PRDX4": 396,
    "PRF1": 397,
    "PSMB10": 398,
    "PTEN": 399,
    "PTGS1": 400,
    "PTPN2": 401,
    "PTPRC": 402,
    "RARRES2": 403,
    "RB1": 404,
    "REG4": 405,
    "RGS1": 406,
    "RGS5": 407,
    "RNF43": 408,
    "RORC": 409,
    "RUNX3": 410,
    "S100A1": 411,
    "S100A9": 412,
    "S100B": 413,
    "SAMD3": 414,
    "SDC1": 415,
    "SELL": 416,
    "SIGLEC1": 417,
    "SLC1A3": 418,
    "SMAD3": 419,
    "SOCS1": 420,
    "SOCS2": 421,
    "SOCS3": 422,
    "SOS1": 423,
    "SOX17": 424,
    "SOX2": 425,
    "SOX9": 426,
    "SPARC": 427,
    "SPARCL1": 428,
    "SPIB": 429,
    "SPON2": 430,
    "SPP1": 431,
    "SSR4": 432,
    "STAT1": 433,
    "STAT2": 434,
    "STAT3": 435,
    "STAT4": 436,
    "STAT5B": 437,
    "STAT6": 438,
    "STMN1": 439,
    "STRA6": 440,
    "SYK": 441,
    "TAC1": 442,
    "TBX21": 443,
    "TC2N": 444,
    "TCF7": 445,
    "TCL1A": 446,
    "TFF3": 447,
    "TGFB1": 448,
    "TIGIT": 449,
    "TIMP1": 450,
    "TIMP2": 451,
    "TIMP3": 452,
    "TMPRSS2": 453,
    "TNC": 454,
    "TNF": 455,
    "TNFRSF13C": 456,
    "TNFRSF17": 457,
    "TNFRSF1B": 458,
    "TNFRSF9": 459,
    "TOP2A": 460,
    "TOX": 461,
    "TOX2": 462,
    "TP53": 463,
    "TRAC": 464,
    "TRAT1": 465,
    "TRDC": 466,
    "TRDV1": 467,
    "TRDV2": 468,
    "TRDV3": 469,
    "TREM2": 470,
    "TRGC1": 471,
    "TRGC2": 472,
    "TUBA1B": 473,
    "TUBB": 474,
    "TXLNA": 475,
    "UBE2C": 476,
    "VCAN": 477,
    "VEGFA": 478,
    "VSIG4": 479,
    "VSIR": 480,
    "VWF": 481,
    "XBP1": 482,
    "ZNF683": 483
}